src/main/resources/doSeatAvailabilityPnr.text

<?xml version="1.0"?> <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.iata.org/IATA/EDIST/2017.2"><soapenv:Header/><soapenv:Body><ns2:SeatAvailabilityRQ xmlns:ns2="http://www.iata.org/IATA/EDIST/2017.2" xmlns:ns3="http://hititcs.com/ndc/types/custom" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" Version="IATA2017.2" PrimaryLangID="TR" xsi:schemaLocation="xmldsig-core-schema.xsd"><ns2:Document><ns2:Name>PC NDC GATEWAY</ns2:Name><ns2:ReferenceVersion>1.0</ns2:ReferenceVersion></ns2:Document><ns2:Party><ns2:Sender><ns2:TravelAgencySender><ns2:Contacts><ns2:Contact><ns2:EmailContact><ns2:Address>IATI</ns2:Address></ns2:EmailContact></ns2:Contact></ns2:Contacts><ns2:AgencyID>IATI</ns2:AgencyID><ns2:AgentUser><ns2:Name>IATI</ns2:Name><ns2:AgentUserID>T621OC48</ns2:AgentUserID><ns2:UserRole>ADMIN</ns2:UserRole></ns2:AgentUser></ns2:TravelAgencySender></ns2:Sender></ns2:Party><ns2:Parameters><ns2:Languages><ns2:LanguageCode>TR</ns2:LanguageCode></ns2:Languages><ns2:CurrCodes><ns2:FiledInCurrency><ns2:CurrCode>TRY</ns2:CurrCode></ns2:FiledInCurrency></ns2:CurrCodes></ns2:Parameters><ns2:Query><ns2:Order OrderID="replaceOrderId" Owner="PC"><ns2:SegmentID>replaceSegmentKey</ns2:SegmentID></ns2:Order></ns2:Query></ns2:SeatAvailabilityRQ></soapenv:Body></soapenv:Envelope>
